In [106]:
import pandas as pd

In [107]:
import numpy as np

In [108]:
labels = ['a','b','c']

In [109]:
mylist = [10,20,30]

In [110]:
arr = np.array(mylist)

In [111]:
arr

array([10, 20, 30])

In [112]:
d = { 'a' : 10 , 'b' : 20 , 'c' : 30}

In [113]:
pd.Series(data = mylist)

0    10
1    20
2    30
dtype: int64

In [114]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [115]:
pd.Series (data = arr , index = labels)

a    10
b    20
c    30
dtype: int64

In [116]:
pd.Series(data=['d','e',10,'a',4.4])

0      d
1      e
2     10
3      a
4    4.4
dtype: object

In [117]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])

In [118]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [119]:
ser1['USA']

1

In [120]:
ser2 = pd.Series([1,4,5,6],index=['USA','Germany','Italy','Japan'])

In [121]:
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [122]:
ser1 + ser2

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

In [123]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [124]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [125]:
df = pd.DataFrame(data = rand_mat , index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [127]:
df ['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [128]:
type(df['W'])

pandas.core.series.Series

In [129]:
mylist = ['W','Y']

In [130]:
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [131]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [132]:
df["NEW"] = df["W"] + df["Y"]

In [133]:
df.NEW

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: NEW, dtype: float64

In [134]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [135]:
df.drop("NEW" , axis = 1 , inplace= True)

In [136]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [137]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [139]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [141]:
df.iloc[0:2]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [142]:
df.loc[['A','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [145]:
df.loc [['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [146]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965